AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
/* Register addresses *******************************************************/

#define DA1470X_EMMC_BASE                                0x30058000 /* EMMC registers */

#define DA1470X_EMMC_EMMC_ADMA_ERR_STAT_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ADMA_ERR_STAT_R_OFFSET) /* This register stores the ADMA state during an ADMA error. This register is appli */
#define DA1470X_EMMC_EMMC_ADMA_SA_LOW_R                  (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ADMA_SA_LOW_R_OFFSET) /* This register holds the lower 32-bit system address for DMA transfer. This regis */
#define DA1470X_EMMC_EMMC_ARGUMENT_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ARGUMENT_R_OFFSET) /* This register is used to configure the SD/eMMC command argument. */
#define DA1470X_EMMC_EMMC_AT_CTRL_R                      (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_AT_CTRL_R_OFFSET) /* This register controls some aspects of tuning and auto-tuning features. Do not p */
#define DA1470X_EMMC_EMMC_AT_STAT_R                      (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_AT_STAT_R_OFFSET) /* Register to read the Center, Left and Right codes used by tuning and auto-tuning */
#define DA1470X_EMMC_EMMC_AUTO_CMD_STAT_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_AUTO_CMD_STAT_R_OFFSET) /* This register is used to indicate the CMD12 response error of Auto CMD12, and th */
#define DA1470X_EMMC_EMMC_BGAP_CTRL_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_BGAP_CTRL_R_OFFSET) /* This register is used by the host driver to control any operation related to Blo */
#define DA1470X_EMMC_EMMC_BLOCKCOUNT_R                   (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_BLOCKCOUNT_R_OFFSET) /* This register is used to configure the number of data blocks. This register is a */
#define DA1470X_EMMC_EMMC_BLOCKSIZE_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_BLOCKSIZE_R_OFFSET) /* This register is used to configure an SDMA buffer boundary and the number of byt */
#define DA1470X_EMMC_EMMC_BOOT_CTRL_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_BOOT_CTRL_R_OFFSET) /* This register is used to control the eMMC Boot operation. */
#define DA1470X_EMMC_EMMC_BUF_DATA_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_BUF_DATA_R_OFFSET) /* This register is used to access the packet buffer. This register is applicable f */
#define DA1470X_EMMC_EMMC_CAPABILITIES1_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CAPABILITIES1_R_OFFSET) /* This register provides the Host Driver with information specific to the Host Con */
#define DA1470X_EMMC_EMMC_CAPABILITIES2_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CAPABILITIES2_R_OFFSET) /* This register provides the Host Driver with information specific to the Host Con */
#define DA1470X_EMMC_EMMC_CLK_CTRL_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CLK_CTRL_R_OFFSET) /* This register controls SDCLK (card clock) in an SD/eMMC mode and RCLK in the UHS */
#define DA1470X_EMMC_EMMC_CMD_R                          (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CMD_R_OFFSET) /* This register is used to provide the information related to a command and a resp */
#define DA1470X_EMMC_EMMC_CQCAP                          (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CQCAP_OFFSET) /* This register indicates the capabilities of the command queuing engine. */
#define DA1470X_EMMC_EMMC_CTRL_R                         (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CTRL_R_OFFSET) /* This register is used to control the operation of EMMC Controller. */
#define DA1470X_EMMC_EMMC_CURR_CAPABILITIES1_R           (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CURR_CAPABILITIES1_R_OFFSET) /* This register indicate the maximum current capability for each voltage, for VDD1 */
#define DA1470X_EMMC_EMMC_CURR_CAPABILITIES2_R           (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_CURR_CAPABILITIES2_R_OFFSET) /* This register indicates the maximum current capability for each voltage (for VDD */
#define DA1470X_EMMC_EMMC_EMBEDDED_CTRL_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_EMBEDDED_CTRL_R_OFFSET) /* This register controls the embedded device. When the Host Controller is connecte */
#define DA1470X_EMMC_EMMC_EMMC_CTRL_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_EMMC_CTRL_R_OFFSET) /* This register is used to control the eMMC operation. */
#define DA1470X_EMMC_EMMC_ERROR_INT_SIGNAL_EN_R          (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_OFFSET) /* This register is used to select the interrupt status that is notified to the Hos */
#define DA1470X_EMMC_EMMC_ERROR_INT_STAT_EN_R            (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ERROR_INT_STAT_EN_R_OFFSET) /* This register sets the Interrupt Status for Error Interrupt Status register (ERR */
#define DA1470X_EMMC_EMMC_ERROR_INT_STAT_R               (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_ERROR_INT_STAT_R_OFFSET) /* This register enables an interrupt when the Error Interrupt Status Enable is ena */
#define DA1470X_EMMC_EMMC_FORCE_AUTO_CMD_STAT_R          (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_OFFSET) /* The register is not a physically implemented but is an address at which the Auto */
#define DA1470X_EMMC_EMMC_FORCE_ERROR_INT_STAT_R         (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_FORCE_ERROR_INT_STAT_R_OFFSET) /* This register is not physically implemented but is an address at which the Error */
#define DA1470X_EMMC_EMMC_HOST_CNTRL_VERS_R              (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_HOST_CNTRL_VERS_R_OFFSET) /* This register is used to indicate the Host Controller Version number. */
#define DA1470X_EMMC_EMMC_HOST_CTRL1_R                   (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_HOST_CTRL1_R_OFFSET) /* This register is used to control the operation of the Host Controller. This regi */
#define DA1470X_EMMC_EMMC_HOST_CTRL2_R                   (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_HOST_CTRL2_R_OFFSET) /* This register is used to control how the Host Controller operates. This register */
#define DA1470X_EMMC_EMMC_MBIU_CTRL_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_MBIU_CTRL_R_OFFSET) /* This register is used to select the valid burst types that the AHB Master bus in */
#define DA1470X_EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R         (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_OFFSET) /* This register is used to select the interrupt status that is indicated to the Ho */
#define DA1470X_EMMC_EMMC_NORMAL_INT_STAT_EN_R           (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_NORMAL_INT_STAT_EN_R_OFFSET) /* This register enables the Interrupt Status for Normal Interrupt Status register  */
#define DA1470X_EMMC_EMMC_NORMAL_INT_STAT_R              (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_NORMAL_INT_STAT_R_OFFSET) /* This register reflects the status of the Normal Interrupt. This register is appl */
#define DA1470X_EMMC_EMMC_PRESET_DDR50_R                 (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_DDR50_R_OFFSET) /* This register defines the Preset Value for DDR50 and High Speed DDR speed modes  */
#define DA1470X_EMMC_EMMC_PRESET_DS_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_DS_R_OFFSET) /* This register defines Preset Value for Default Speed mode in SD mode. */
#define DA1470X_EMMC_EMMC_PRESET_HS_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_HS_R_OFFSET) /* This register defines Preset Value for High Speed mode in SD mode. */
#define DA1470X_EMMC_EMMC_PRESET_INIT_R                  (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_INIT_R_OFFSET) /* This register defines Preset Value for Initialization in SD/eMMC mode. */
#define DA1470X_EMMC_EMMC_PRESET_SDR104_R                (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_SDR104_R_OFFSET) /* This register defines Preset Value for SDR104 and HS200 speed modes in the SD an */
#define DA1470X_EMMC_EMMC_PRESET_SDR12_R                 (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_SDR12_R_OFFSET) /* This register defines Preset Value for SDR12 and Legacy speed mode in SD and eMM */
#define DA1470X_EMMC_EMMC_PRESET_SDR25_R                 (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_SDR25_R_OFFSET) /* This register defines Preset Value for SDR25 and High Speed SDR speed mode in SD */
#define DA1470X_EMMC_EMMC_PRESET_SDR50_R                 (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_SDR50_R_OFFSET) /* This register defines Preset Value for SDR50 speed mode in SD mode. */
#define DA1470X_EMMC_EMMC_PRESET_UHS2_R                  (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PRESET_UHS2_R_OFFSET) /* This register is used to hold the preset value for UHS-II and HS400 speed modes  */
#define DA1470X_EMMC_EMMC_PSTATE                         (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PSTATE_OFFSET) /* This register indicates the present status of the Host Controller. This register */
#define DA1470X_EMMC_EMMC_PWR_CTRL_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_PWR_CTRL_R_OFFSET) /* This register is used to control the bus power for the Card. This register is ap */
#define DA1470X_EMMC_EMMC_P_EMBEDDED_CNTRL               (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_P_EMBEDDED_CNTRL_OFFSET) /* This register points to the location of UHS-II embedded control registers. */
#define DA1470X_EMMC_EMMC_P_VENDOR_SPECIFIC_AREA         (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_P_VENDOR_SPECIFIC_AREA_OFFSET) /* This register used as a pointer for the Vendor Specific Area 1. */
#define DA1470X_EMMC_EMMC_P_VNDR2_SPECIFIC_AREA          (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_P_VNDR2_SPECIFIC_AREA_OFFSET) /* This register is used as a pointer for the Vendor Specific Area 2. */
#define DA1470X_EMMC_EMMC_RESP01_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_RESP01_R_OFFSET) /* This register stores 39-08 bits of the Response Field for an SD/eMMC mode.  The  */
#define DA1470X_EMMC_EMMC_RESP23_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_RESP23_R_OFFSET) /* This register stores 71-40 bits of the Response Field for an SD/eMMC mode. This  */
#define DA1470X_EMMC_EMMC_RESP45_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_RESP45_R_OFFSET) /* This register stores 103-72 bits of the Response Field for an SD/eMMC mode.  The */
#define DA1470X_EMMC_EMMC_RESP67_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_RESP67_R_OFFSET) /* This register stores 135-104 bits of the Response Field for an SD/eMMC mode.     */
#define DA1470X_EMMC_EMMC_SDMASA_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_SDMASA_R_OFFSET) /* This register is used to configure a 32-bit Block Count or an SDMA System Addres */
#define DA1470X_EMMC_EMMC_SLOT_INTR_STATUS_R             (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_SLOT_INTR_STATUS_R_OFFSET) /* This register indicates the Interrupt status of each slot. */
#define DA1470X_EMMC_EMMC_SW_RST_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_SW_RST_R_OFFSET) /* This register is used to generate a reset pulse by writing 1 to each bit of this */
#define DA1470X_EMMC_EMMC_TOUT_CTRL_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_TOUT_CTRL_R_OFFSET) /* This register is used to set the Data Timeout Counter value for an SD/eMMC mode  */
#define DA1470X_EMMC_EMMC_VER_ID_R                       (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_VER_ID_R_OFFSET) /* This register reflects the current release number of eMMC. */
#define DA1470X_EMMC_EMMC_VER_TYPE_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_VER_TYPE_R_OFFSET) /* This register reflects the current release type of eMMC. */
#define DA1470X_EMMC_EMMC_WUP_CTRL_R                     (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_WUP_CTRL_R_OFFSET) /* This register is mandatory for the Host Controller, but the wakeup functionality */
#define DA1470X_EMMC_EMMC_XFER_MODE_R                    (DA1470X_EMMC_BASE + DA1470X_EMMC_EMMC_XFER_MODE_R_OFFSET) /* This register is used to control the operation of data transfers for an SD/eMMC  */

/* Register bit definitions *************************************************/


/* EMMC_ADMA_ERR_STAT_R Register */

