AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
#define EMMC_CRYPTO_SUPPORT                              (1U << 28) /* Crypto Support    This bit indicates whether the Host Controller supports crypto */
#define EMMC_CQCCAP_RSVD2_MASK                           (0xFFF << 16) /* These bits [27:16] of the CQCAP register are reserved. They always return 0. */
#define EMMC_CQCCAP_RSVD2_POS                            (16) /* These bits [27:16] of the CQCAP register are reserved. They always return 0. */
#define EMMC_ITCFMUL_MASK                                (0xF << 12) /* Internal Timer Clock Frequency Multiplier (ITCFMUL) This field indicates the fre */
#define EMMC_ITCFMUL_POS                                 (12) /* Internal Timer Clock Frequency Multiplier (ITCFMUL) This field indicates the fre */
#define EMMC_ITCFVAL_MASK                                (0x3FF << 0) /* Internal Timer Clock Frequency Value (ITCFVAL) This field scales the frequency o */
#define EMMC_ITCFVAL_POS                                 (0) /* Internal Timer Clock Frequency Value (ITCFVAL) This field scales the frequency o */

/* EMMC_CTRL_R Register */

#define EMMC_SW_CG_DIS                                   (1U << 4) /* Internal clock gating disable control This bit must be used to disable IP's inte */
#define EMMC_CMD_CONFLICT_CHECK                          (1U << 0) /* Command conflict check This bit enables command conflict check. Note:emmc contro */

/* EMMC_CURR_CAPABILITIES1_R Register */

#define EMMC_MAX_CUR_18V_MASK                            (0xFF << 16) /* Maximum Current for 1.8 V This bit specifies the Maximum Current for 1.8 V VDD1  */
#define EMMC_MAX_CUR_18V_POS                             (16) /* Maximum Current for 1.8 V This bit specifies the Maximum Current for 1.8 V VDD1  */
#define EMMC_MAX_CUR_30V_MASK                            (0xFF << 8) /* Maximum Current for 3.0 V This bit specifies the Maximum Current for 3.0 V VDD1  */
#define EMMC_MAX_CUR_30V_POS                             (8) /* Maximum Current for 3.0 V This bit specifies the Maximum Current for 3.0 V VDD1  */
#define EMMC_MAX_CUR_33V_MASK                            (0xFF << 0) /* Maximum Current for 3.3 V This bit specifies the Maximum Current for 3.3 V VDD1  */
#define EMMC_MAX_CUR_33V_POS                             (0) /* Maximum Current for 3.3 V This bit specifies the Maximum Current for 3.3 V VDD1  */

/* EMMC_CURR_CAPABILITIES2_R Register */

#define EMMC_MAX_CUR_VDD2_18V_MASK                       (0xFF << 0) /* Maximum Current for 1.8 V VDD2 This bit specifies the Maximum Current for 1.8 V  */
#define EMMC_MAX_CUR_VDD2_18V_POS                        (0) /* Maximum Current for 1.8 V VDD2 This bit specifies the Maximum Current for 1.8 V  */

/* EMMC_EMBEDDED_CTRL_R Register */

#define EMMC_BACK_END_PWR_CTRL_MASK                      (0x7F << 24) /* Back-End Power Control (SD Mode)  Each bit of this field controls back-end power */
#define EMMC_BACK_END_PWR_CTRL_POS                       (24) /* Back-End Power Control (SD Mode)  Each bit of this field controls back-end power */
#define EMMC_INT_PIN_SEL_MASK                            (0x7 << 20) /* Interrupt Pin Select  These bits enable the interrupt pin inputs. - 000 : Interr */
#define EMMC_INT_PIN_SEL_POS                             (20) /* Interrupt Pin Select  These bits enable the interrupt pin inputs. - 000 : Interr */
#define EMMC_CLK_PIN_SEL_MASK                            (0x7 << 16) /* Clock Pin Select (SD Mode)  This bit is selected by one of clock pin outputs. -  */
#define EMMC_CLK_PIN_SEL_POS                             (16) /* Clock Pin Select (SD Mode)  This bit is selected by one of clock pin outputs. -  */
#define EMMC_BUS_WIDTH_PRESET_MASK                       (0x7F << 8) /* Bus Width Preset (SD Mode)  Each bit of this field specifies the bus width for e */
#define EMMC_BUS_WIDTH_PRESET_POS                        (8) /* Bus Width Preset (SD Mode)  Each bit of this field specifies the bus width for e */
#define EMMC_NUM_INT_PIN_MASK                            (0x3 << 4) /* Number of Interrupt Input Pins  This field indicates support of interrupt input  */
#define EMMC_NUM_INT_PIN_POS                             (4) /* Number of Interrupt Input Pins  This field indicates support of interrupt input  */
#define EMMC_NUM_CLK_PIN_MASK                            (0x7 << 0) /* Number of Clock Pins (SD Mode)  This field indicates support of clock pins to se */
#define EMMC_NUM_CLK_PIN_POS                             (0) /* Number of Clock Pins (SD Mode)  This field indicates support of clock pins to se */

/* EMMC_EMMC_CTRL_R Register */

#define EMMC_EMMC_RST_N_OE                               (1U << 3) /* Output Enable control for EMMC Device Reset signal PAD control. This field drive */
#define EMMC_EMMC_RST_N                                  (1U << 2) /* EMMC Device Reset signal control. This register field controls the sd_rst_n outp */
#define EMMC_DISABLE_DATA_CRC_CHK                        (1U << 1) /* Disable Data CRC Check This bit controls masking of CRC16 error for Card Write i */
#define EMMC_CARD_IS_EMMC                                (1U << 0) /* eMMC Card present This bit indicates the type of card connected. An application  */

/* EMMC_ERROR_INT_SIGNAL_EN_R Register */

#define EMMC_VENDOR_ERR_SIGNAL_EN3                       (1U << 15) /* The 16th bit of Error Interrupt Signal Enable is reserved. Values: 0x0 (FALSE):  */
#define EMMC_VENDOR_ERR_SIGNAL_EN2                       (1U << 14) /* The 15th bit of Error Interrupt Signal Enable is reserved. Values: 0x0 (FALSE):  */
#define EMMC_VENDOR_ERR_SIGNAL_EN1                       (1U << 13) /* The 14th bit of Error Interrupt Signal Enable is reserved. Values: 0x0 (FALSE):  */
#define EMMC_BOOT_ACK_ERR_SIGNAL_EN                      (1U << 12) /* Boot Acknowledgment Error (eMMC Mode only). Setting this bit to 1 enables genera */
#define EMMC_RESP_ERR_SIGNAL_EN                          (1U << 11) /* Response Error Signal Enable (SD Mode only) Values: 0x0 (FALSE): Masked 0x1 (TRU */
#define EMMC_TUNING_ERR_SIGNAL_EN                        (1U << 10) /* Tuning Error Signal Enable (UHS-I Mode only) Values: 0x0 (FALSE): Masked 0x1 (TR */
#define EMMC_ADMA_ERR_SIGNAL_EN                          (1U << 9) /* ADMA Error Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_AUTO_CMD_ERR_SIGNAL_EN                      (1U << 8) /* Auto CMD Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Masked 0x1 */
#define EMMC_CUR_LMT_ERR_SIGNAL_EN                       (1U << 7) /* Current Limit Error Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enable */
#define EMMC_DATA_END_BIT_ERR_SIGNAL_EN                  (1U << 6) /* Data End Bit Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Masked */
#define EMMC_DATA_CRC_ERR_SIGNAL_EN                      (1U << 5) /* Data CRC Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Masked 0x1 */
#define EMMC_DATA_TOUT_ERR_SIGNAL_EN                     (1U << 4) /* Data Timeout Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Masked */
#define EMMC_CMD_IDX_ERR_SIGNAL_EN                       (1U << 3) /* Command Index Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Maske */
#define EMMC_CMD_END_BIT_ERR_SIGNAL_EN                   (1U << 2) /* Command End Bit Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Mas */
#define EMMC_CMD_CRC_ERR_SIGNAL_EN                       (1U << 1) /* Command CRC Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Masked  */
#define EMMC_CMD_TOUT_ERR_SIGNAL_EN                      (1U << 0) /* Command Timeout Error Signal Enable (SD/eMMC Mode only) Values: 0x0 (FALSE): Mas */

