AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
/* EMMC_ERROR_INT_STAT_EN_R Register */

#define EMMC_VENDOR_ERR_STAT_EN3                         (1U << 15) /* The 15th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define EMMC_VENDOR_ERR_STAT_EN2                         (1U << 14) /* The 14th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define EMMC_VENDOR_ERR_STAT_EN1                         (1U << 13) /* The 13th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define EMMC_BOOT_ACK_ERR_STAT_EN                        (1U << 12) /* Boot Acknowledgment Error (eMMC Mode only) Setting this bit to 1 enables setting */
#define EMMC_RESP_ERR_STAT_EN                            (1U << 11) /* Response Error Status Enable (SD Mode only) Values:  0x0 (FALSE): Masked 0x1 (TR */
#define EMMC_TUNING_ERR_STAT_EN                          (1U << 10) /* Tuning Error Status Enable (UHS-I Mode only) Values:  0x0 (FALSE): Masked 0x1 (T */
#define EMMC_ADMA_ERR_STAT_EN                            (1U << 9) /* ADMA Error Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_AUTO_CMD_ERR_STAT_EN                        (1U << 8) /* Auto CMD Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): Masked 0 */
#define EMMC_CUR_LMT_ERR_STAT_EN                         (1U << 7) /* Current Limit Error Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabl */
#define EMMC_DATA_END_BIT_ERR_STAT_EN                    (1U << 6) /* Data End Bit Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): Mask */
#define EMMC_DATA_CRC_ERR_STAT_EN                        (1U << 5) /* Data CRC Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked 0x */
#define EMMC_DATA_TOUT_ERR_STAT_EN                       (1U << 4) /* Data Timeout Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Maske */
#define EMMC_CMD_IDX_ERR_STAT_EN                         (1U << 3) /* Command Index Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Mask */
#define EMMC_CMD_END_BIT_ERR_STAT_EN                     (1U << 2) /* Command End Bit Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Ma */
#define EMMC_CMD_CRC_ERR_STAT_EN                         (1U << 1) /* Command CRC Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked */
#define EMMC_CMD_TOUT_ERR_STAT_EN                        (1U << 0) /* Command Timeout Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): M */

/* EMMC_ERROR_INT_STAT_R Register */

#define EMMC_BOOT_ACK_ERR                                (1U << 12) /* Boot Acknowledgement Error. This bit is set when there is a timeout for boot ack */
#define EMMC_RESP_ERR                                    (1U << 11) /* Response Error. Host Controller Version 4.00 supports response error check funct */
#define EMMC_TUNING_ERR                                  (1U << 10) /* Tuning Error. This bit is set when an unrecoverable error is detected in a tunin */
#define EMMC_ADMA_ERR                                    (1U << 9) /* ADMA Error. This bit is set when the Host Controller detects error during ADMA-b */
#define EMMC_AUTO_CMD_ERR                                (1U << 8) /* Auto CMD Error. This error status is used by Auto CMD12 and Auto CMD23 in SD/eMM */
#define EMMC_CUR_LMT_ERR                                 (1U << 7) /* Current Limit Error. By setting the SD Bus Power bit in the Power Control regist */
#define EMMC_DATA_END_BIT_ERR                            (1U << 6) /* Data End Bit Error. This error occurs in SD/eMMC mode either when detecting 0 at */
#define EMMC_DATA_CRC_ERR                                (1U << 5) /* Data CRC Error. This error occurs in SD/eMMC mode when detecting CRC error when  */
#define EMMC_DATA_TOUT_ERR                               (1U << 4) /* Data Timeout Error. This bit is set in SD/eMMC mode when detecting one of the fo */
#define EMMC_CMD_IDX_ERR                                 (1U << 3) /* Command Index Error. This bit is set if a Command Index error occurs in the comm */
#define EMMC_CMD_END_BIT_ERR                             (1U << 2) /* Command End Bit Error. This bit is set when detecting that the end bit of a comm */
#define EMMC_CMD_CRC_ERR                                 (1U << 1) /* Command CRC Error. Command CRC Error is generated in SD/eMMC mode for following  */
#define EMMC_CMD_TOUT_ERR                                (1U << 0) /* Command Timeout Error. In SD/eMMC Mode,this bit is set only if no response is re */

/* EMMC_FORCE_AUTO_CMD_STAT_R Register */

#define EMMC_FORCE_CMD_NOT_ISSUED_AUTO_CMD12             (1U << 7) /* Force Event for Command Not Issued By Auto CMD12 Error Values: 0x1 (TRUE): Comma */
#define EMMC_FORCE_AUTO_CMD_RESP_ERR                     (1U << 5) /* Force Event for Auto CMD Response Error Values: 0x1 (TRUE): Auto CMD Response Er */
#define EMMC_FORCE_AUTO_CMD_IDX_ERR                      (1U << 4) /* Force Event for Auto CMD Index Error Values: 0x1 (TRUE): Auto CMD Index Error St */
#define EMMC_FORCE_AUTO_CMD_EBIT_ERR                     (1U << 3) /* Force Event for Auto CMD End Bit Error Values: 0x1 (TRUE): Auto CMD End Bit Erro */
#define EMMC_FORCE_AUTO_CMD_CRC_ERR                      (1U << 2) /* Force Event for Auto CMD CRC Error Values: 0x1 (TRUE): Auto CMD CRC Error Status */
#define EMMC_FORCE_AUTO_CMD_TOUT_ERR                     (1U << 1) /* Force Event for Auto CMD Timeout Error Values: 0x1 (TRUE): Auto CMD Timeout Erro */
#define EMMC_FORCE_AUTO_CMD12_NOT_EXEC                   (1U << 0) /* Force Event for Auto CMD12 Not Executed Values: 0x1 (TRUE): Auto CMD12 Not Execu */

/* EMMC_FORCE_ERROR_INT_STAT_R Register */

#define EMMC_FORCE_VENDOR_ERR3                           (1U << 15) /* This bit (FORCE_VENDOR_ERR3) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define EMMC_FORCE_VENDOR_ERR2                           (1U << 14) /* This bit (FORCE_VENDOR_ERR2) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define EMMC_FORCE_VENDOR_ERR1                           (1U << 13) /* This bit (FORCE_VENDOR_ERR1) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define EMMC_FORCE_BOOT_ACK_ERR                          (1U << 12) /* Force Event for Boot Ack error Values:  0x0 (FALSE): Not Affected 0x1 (TRUE): Bo */
#define EMMC_FORCE_RESP_ERR                              (1U << 11) /* Force Event for Response Error (SD Mode only) Values: 0x0 (FALSE): Not Affected  */
#define EMMC_FORCE_TUNING_ERR                            (1U << 10) /* Force Event for Tuning Error (UHS-I Mode only) */
#define EMMC_FORCE_ADMA_ERR                              (1U << 9) /* Force Event for ADMA Error Values: 0x0 (FALSE): Not Affected 0x1 (TRUE): ADMA Er */
#define EMMC_FORCE_AUTO_CMD_ERR                          (1U << 8) /* Force Event for Auto CMD Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not Affe */
#define EMMC_FORCE_CUR_LMT_ERR                           (1U << 7) /* Force Event for Current Limit Error Values: 0x0 (FALSE): Not Affected 0x1 (TRUE) */
#define EMMC_FORCE_DATA_END_BIT_ERR                      (1U << 6) /* Force Event for Data End Bit Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not  */
#define EMMC_FORCE_DATA_CRC_ERR                          (1U << 5) /* Force Event for Data CRC Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not Affe */
#define EMMC_FORCE_DATA_TOUT_ERR                         (1U << 4) /* Force Event for Data Timeout Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not  */
#define EMMC_FORCE_CMD_IDX_ERR                           (1U << 3) /* Force Event for Command Index Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not */
#define EMMC_FORCE_CMD_END_BIT_ERR                       (1U << 2) /* Force Event for Command End Bit Error (SD/eMMC Mode only) Values: 0x0 (FALSE): N */
#define EMMC_FORCE_CMD_CRC_ERR                           (1U << 1) /* Force Event for Command CRC Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not A */
#define EMMC_FORCE_CMD_TOUT_ERR                          (1U << 0) /* Force Event for Command Timeout Error (SD/eMMC Mode only) Values: 0x0 (FALSE): N */

