AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
/* EMMC_HOST_CNTRL_VERS_R Register */

#define EMMC_VENDOR_VERSION_NUM_MASK                     (0xFF << 8) /* Vendor Version Number               This field is reserved for the vendor versio */
#define EMMC_VENDOR_VERSION_NUM_POS                      (8) /* Vendor Version Number               This field is reserved for the vendor versio */
#define EMMC_SPEC_VERSION_NUM_MASK                       (0xFF << 0) /* Specification Version Number These bits indicate the Host controller specificati */
#define EMMC_SPEC_VERSION_NUM_POS                        (0) /* Specification Version Number These bits indicate the Host controller specificati */

/* EMMC_HOST_CTRL1_R Register */

#define EMMC_CARD_DETECT_SIG_SEL                         (1U << 7) /* Card Detect Signal Selection. This bit selects a source for card detection. When */
#define EMMC_CARD_DETECT_TEST_LVL                        (1U << 6) /* Card Detect Test Level. This bit is enabled while the Card Detect Signal Selecti */
#define EMMC_EXT_DAT_XFER                                (1U << 5) /* Extended Data Transfer Width. This bit controls 8-bit bus width mode of embedded */
#define EMMC_DMA_SEL_MASK                                (0x3 << 3) /* DMA Select. This field is used to select the DMA type. When Host Version 4 Enabl */
#define EMMC_DMA_SEL_POS                                 (3) /* DMA Select. This field is used to select the DMA type. When Host Version 4 Enabl */
#define EMMC_HIGH_SPEED_EN                               (1U << 2) /* High Speed Enable (SD/eMMC Mode only). In SD/eMMC mode, this bit is used to dete */
#define EMMC_DAT_XFER_WIDTH                              (1U << 1) /* Data Transfer Width. For SD/eMMC mode,this bit selects the data transfer width o */
#define EMMC_LED_CTRL                                    (1U << 0) /* LED Control. This bit is used to caution the user not to remove the card while t */

/* EMMC_HOST_CTRL2_R Register */

#define EMMC_PRESET_VAL_ENABLE                           (1U << 15) /* Preset Value Enable This bit enables automatic selection of SDCLK frequency and  */
#define EMMC_ASYNC_INT_ENABLE                            (1U << 14) /* Asynchronous Interrupt Enable This bit can be set if a card supports asynchronou */
#define EMMC_ADDRESSING                                  (1U << 13) /* 64-bit Addressing This bit is effective when Host Version 4 Enable is set to 1.  */
#define EMMC_HOST_VER4_ENABLE                            (1U << 12) /* Host Version 4 Enable This bit selects either Version 3.00 compatible mode or Ve */
#define EMMC_CMD23_ENABLE                                (1U << 11) /* CMD23 Enable If the card supports CMD23, this bit is set to 1. This bit is used  */
#define EMMC_ADMA2_LEN_MODE                              (1U << 10) /* ADMA2 Length Mode This bit selects ADMA2 Length mode to be either 16-bit or 26-b */
#define EMMC_UHS2_IF_ENABLE                              (1U << 8) /* UHS-II Interface Enable This bit is used to enable the UHS-II Interface. The val */
#define EMMC_SAMPLE_CLK_SEL                              (1U << 7) /* Sampling Clock Select This bit is used by the Host Controller to select the samp */
#define EMMC_EXEC_TUNING                                 (1U << 6) /* Execute Tuning This bit is set to 1 to start the tuning procedure in UHS-I/eMMC  */
#define EMMC_DRV_STRENGTH_SEL_MASK                       (0x3 << 4) /* Driver Strength Select This bit is used to select the Host Controller output dri */
#define EMMC_DRV_STRENGTH_SEL_POS                        (4) /* Driver Strength Select This bit is used to select the Host Controller output dri */
#define EMMC_SIGNALING_EN                                (1U << 3) /* 1.8 V Signaling Enable This bit controls voltage regulator for I/O cell in UHS-I */
#define EMMC_UHS_MODE_SEL_MASK                           (0x7 << 0) /* UHS Mode/eMMC Speed Mode Select These bits are used to select UHS mode in the SD */
#define EMMC_UHS_MODE_SEL_POS                            (0) /* UHS Mode/eMMC Speed Mode Select These bits are used to select UHS mode in the SD */

/* EMMC_MBIU_CTRL_R Register */

#define EMMC_BURST_INCR16_EN                             (1U << 3) /* INCR16 Burst Controls generation of INCR16 transfers on Master interface. Values */
#define EMMC_BURST_INCR8_EN                              (1U << 2) /* INCR8 Burst Controls generation of INCR8 transfers on Master interface. Values:  */
#define EMMC_BURST_INCR4_EN                              (1U << 1) /* INCR4 Burst Controls generation of INCR4 transfers on Master interface. Values:  */
#define EMMC_UNDEFL_INCR_EN                              (1U << 0) /* Undefined INCR Burst Controls generation of undefined length INCR transfer on Ma */

/* EMMC_NORMAL_INT_SIGNAL_EN_R Register */

#define EMMC_CQE_EVENT_SIGNAL_EN                         (1U << 14) /* Command Queuing Engine Event Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE */
#define EMMC_FX_EVENT_SIGNAL_EN                          (1U << 13) /* FX Event Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_RE_TUNE_EVENT_SIGNAL_EN                     (1U << 12) /* Re-Tuning Event (UHS-I only) Signal Enable. Values: 0x0 (FALSE): Masked 0x1 (TRU */
#define EMMC_INT_C_SIGNAL_EN                             (1U << 11) /* INT_C (Embedded) Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_INT_B_SIGNAL_EN                             (1U << 10) /* INT_B (Embedded) Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_INT_A_SIGNAL_EN                             (1U << 9) /* INT_A (Embedded) Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CARD_INTERRUPT_SIGNAL_EN                    (1U << 8) /* Card Interrupt Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CARD_REMOVAL_SIGNAL_EN                      (1U << 7) /* Card Removal Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CARD_INSERTION_SIGNAL_EN                    (1U << 6) /* Card Insertion Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BUF_RD_READY_SIGNAL_EN                      (1U << 5) /* Buffer Read Ready Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BUF_WR_READY_SIGNAL_EN                      (1U << 4) /* Buffer Write Ready Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_DMA_INTERRUPT_SIGNAL_EN                     (1U << 3) /* DMA Interrupt Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BGAP_EVENT_SIGNAL_EN                        (1U << 2) /* Block Gap Event Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_XFER_COMPLETE_SIGNAL_EN                     (1U << 1) /* Transfer Complete Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CMD_COMPLETE_SIGNAL_EN                      (1U << 0) /* Command Complete Signal Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */

/* EMMC_NORMAL_INT_STAT_EN_R Register */

