AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
#define EMMC_CQE_EVENT_STAT_EN                           (1U << 14) /* CQE Event Status Enable  Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_FX_EVENT_STAT_EN                            (1U << 13) /* FX Event Status Enable This bit is added from Version 4.10.  Values: 0x0 (FALSE) */
#define EMMC_RE_TUNE_EVENT_STAT_EN                       (1U << 12) /* Re-Tuning Event (UHS-I only) Status Enable  Values: 0x0 (FALSE): Masked 0x1 (TRU */
#define EMMC_INT_C_STAT_EN                               (1U << 11) /* INT_C (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define EMMC_INT_B_STAT_EN                               (1U << 10) /* INT_B (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define EMMC_INT_A_STAT_EN                               (1U << 9) /* INT_A (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define EMMC_CARD_INTERRUPT_STAT_EN                      (1U << 8) /* Card Interrupt Status Enable  If this bit is set to 0, the Host Controller clear */
#define EMMC_CARD_REMOVAL_STAT_EN                        (1U << 7) /* Card Removal Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CARD_INSERTION_STAT_EN                      (1U << 6) /* Card Insertion Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BUF_RD_READY_STAT_EN                        (1U << 5) /* Buffer Read Ready Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BUF_WR_READY_STAT_EN                        (1U << 4) /* Buffer Write Ready Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_DMA_INTERRUPT_STAT_EN                       (1U << 3) /* DMA Interrupt Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_BGAP_EVENT_STAT_EN                          (1U << 2) /* Block Gap Event Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_XFER_COMPLETE_STAT_EN                       (1U << 1) /* Transfer Complete Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define EMMC_CMD_COMPLETE_STAT_EN                        (1U << 0) /* Command Complete Status Enable Values: 0x0 (FALSE): Masked 0x1 (TRUE): Enabled */

/* EMMC_NORMAL_INT_STAT_R Register */

#define EMMC_ERR_INTERRUPT                               (1U << 15) /* Error Interrupt. If any of the bits in the Error Interrupt Status register are s */
#define EMMC_CQE_EVENT                                   (1U << 14) /* Command Queuing Event This status is set if Command Queuing/Crypto related event */
#define EMMC_FX_EVENT                                    (1U << 13) /* FX Event. This status is set when R[14] of response register is set to 1 and Res */
#define EMMC_RE_TUNE_EVENT                               (1U << 12) /* Re-tuning Event. This bit is set if the Re-Tuning Request changes from 0 to 1. R */
#define EMMC_INT_C                                       (1U << 11) /* INT_C (Embedded). This bit is set if INT_C is enabled and if INT_C# pin is in lo */
#define EMMC_INT_B                                       (1U << 10) /* INT_B (Embedded). This bit is set if INT_B is enabled and if INT_B# pin is in lo */
#define EMMC_INT_A                                       (1U << 9) /* INT_A (Embedded). This bit is set if INT_A is enabled and if INT_A# pin is in lo */
#define EMMC_CARD_INTERRUPT                              (1U << 8) /* Card Interrupt. This bit reflects the synchronized value of: - DAT[1] Interrupt  */
#define EMMC_CARD_REMOVAL_STAT_R                         (1U << 7) /* Card Removal. This bit is set if the Card Inserted in the Present State register */
#define EMMC_CARD_INSERTION                              (1U << 6) /* Card Insertion This bit is set if the Card Inserted in the Present State registe */
#define EMMC_BUF_RD_READY                                (1U << 5) /* Buffer Read Ready. This bit is set if the Buffer Read Enable changes from 0 to 1 */
#define EMMC_BUF_WR_READY                                (1U << 4) /* Buffer Write Ready. This bit is set if the Buffer Write Enable changes from 0 to */
#define EMMC_DMA_INTERRUPT                               (1U << 3) /* DMA Interrupt. This bit is set if the Host Controller detects the SDMA Buffer Bo */
#define EMMC_BGAP_EVENT                                  (1U << 2) /* Block Gap Event. This bit is set when both read/write transaction is stopped at  */
#define EMMC_XFER_COMPLETE                               (1U << 1) /* Transfer Complete. This bit is set when a read/write transfer and a command with */
#define EMMC_CMD_COMPLETE                                (1U << 0) /* Command Complete. In an SD/eMMC Mode, this bit is set when the end bit of a resp */

/* EMMC_PRESET_DDR50_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */

/* EMMC_PRESET_DS_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_HS_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_INIT_R Register */

