AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate that the Driver strength is sup */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate that the Driver strength is sup */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when the Host Controller supp */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR104_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */

/* EMMC_PRESET_SDR12_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR25_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR50_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_UHS2_R Register */

#define EMMC_DRV_SEL_VAL_MASK                            (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_DRV_SEL_VAL_POS                             (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define EMMC_CLK_GEN_SEL_VAL                             (1U << 10) /* Clock Generator Select Value This bit is effective when the Host Controller supp */
#define EMMC_FREQ_SEL_VAL_MASK                           (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify the 10-bit preset value tha */
#define EMMC_FREQ_SEL_VAL_POS                            (0) /* SDCLK/RCLK Frequency Select Value These bits specify the 10-bit preset value tha */

/* EMMC_PSTATE Register */

#define EMMC_UHS2_IF_DETECT                              (1U << 31) /* UHS-II Interface Detection. For SD/eMMC mode, this bit always returns 0.  Values */
#define EMMC_LANE_SYNC                                   (1U << 30) /* Lane Synchronization. For SD/eMMC mode, this bit always returns 0.  Values: 0x0  */
#define EMMC_IN_DORMANT_ST                               (1U << 29) /* In Dormant Status For SD/eMMC mode, this bit always returns 0.  Values: 0x0 (FAL */
#define EMMC_SUB_CMD_STAT                                (1U << 28) /* Sub Command Status. This bit is used to distinguish between a main command and a */
#define EMMC_CMD_ISSUE_ERR                               (1U << 27) /* Command Not Issued by Error. This bit is set if a command cannot be issued after */
#define EMMC_HOST_REG_VOL                                (1U << 25) /* Host Regulator Voltage Stable. This bit is used to check whether the host regula */
#define EMMC_CMD_LINE_LVL                                (1U << 24) /* Command-Line Signal Level. This bit is used to check the CMD line level to recov */
#define EMMC_DAT_3_0_MASK                                (0xF << 20) /* DAT[3:0] Line Signal Level. This bit is used to check the DAT line level to reco */
#define EMMC_DAT_3_0_POS                                 (20) /* DAT[3:0] Line Signal Level. This bit is used to check the DAT line level to reco */
#define EMMC_WR_PROTECT_SW_LVL                           (1U << 19) /* Write Protect Switch Pin Level. This bit is supported only for memory and combo  */
#define EMMC_CARD_DETECT_PIN_LEVEL                       (1U << 18) /* Card Detect Pin Level. This bit reflects the inverse synchronized value of the c */
#define EMMC_CARD_STABLE                                 (1U << 17) /* Card Stable. This bit indicates the stability of the Card Detect Pin Level. A ca */
#define EMMC_CARD_INSERTED                               (1U << 16) /* Card Inserted. This bit indicates whether a card has been inserted. The Host Con */
#define EMMC_BUF_RD_ENABLE                               (1U << 11) /* Buffer Read Enable. This bit is used for non-DMA transfers. This bit is set if v */
#define EMMC_BUF_WR_ENABLE                               (1U << 10) /* Buffer Write Enable. This bit is used for non-DMA transfers. This bit is set if  */
#define EMMC_RD_XFER_ACTIVE                              (1U << 9) /* Read Transfer Active. This bit indicates whether a read transfer is active for S */
#define EMMC_WR_XFER_ACTIVE                              (1U << 8) /* Write Transfer Active. This status indicates whether a write transfer is active  */
#define EMMC_DAT_7_4_MASK                                (0xF << 4) /* DAT[7:4] Line Signal Level. This bit is used to check the DAT line level to reco */
#define EMMC_DAT_7_4_POS                                 (4) /* DAT[7:4] Line Signal Level. This bit is used to check the DAT line level to reco */
#define EMMC_RE_TUNE_REQ                                 (1U << 3) /* Re-Tuning Request. emmc does not generate retuning request. The software must ma */
#define EMMC_DAT_LINE_ACTIVE                             (1U << 2) /* DAT Line Active (SD/eMMC Mode only). This bit indicates whether one of the DAT l */
#define EMMC_CMD_INHIBIT_DAT                             (1U << 1) /* Command Inhibit (DAT). This bit is applicable for SD/eMMC mode and is generated  */
#define EMMC_CMD_INHIBIT                                 (1U << 0) /* Command Inhibit (CMD). This bit indicates the following : - SD/eMMC mode: If thi */

/* EMMC_PWR_CTRL_R Register */

#define EMMC_SD_BUS_VOL_VDD2_MASK                        (0x7 << 5) /* SD Bus Voltage Select for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x */
#define EMMC_SD_BUS_VOL_VDD2_POS                         (5) /* SD Bus Voltage Select for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x */
#define EMMC_SD_BUS_PWR_VDD2                             (1U << 4) /* SD Bus Power for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x0 (OFF):  */
#define EMMC_SD_BUS_VOL_VDD1_MASK                        (0x7 << 1) /* SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD. These bits enabl */
#define EMMC_SD_BUS_VOL_VDD1_POS                         (1) /* SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD. These bits enabl */
#define EMMC_SD_BUS_PWR_VDD1                             (1U << 0) /* SD Bus Power for VDD1. This bit enables VDD1 power of the card. This setting is  */

/* EMMC_P_EMBEDDED_CNTRL Register */

#define EMMC_REG_OFFSET_EMBEDDED_CNTRL_ADDR_MASK         (0xFFF << 0) /* Offset Address of Embedded Control register. */
#define EMMC_REG_OFFSET_EMBEDDED_CNTRL_ADDR_POS          (0) /* Offset Address of Embedded Control register. */

