AlmAck/svdtonuttx/demo/h/da1470x_emmc.h
/* EMMC_P_VENDOR_SPECIFIC_AREA Register */

#define EMMC_REG_OFFSET_ADDR_VENDOR_MASK                 (0xFFF << 0) /* Base offset Address for Vendor-Specific registers. */
#define EMMC_REG_OFFSET_ADDR_VENDOR_POS                  (0) /* Base offset Address for Vendor-Specific registers. */

/* EMMC_P_VNDR2_SPECIFIC_AREA Register */

#define EMMC_REG_OFFSET_ADDR_VNDR2_MASK                  (0xFFFF << 0) /* Base offset Address for Command Queuing registers. */
#define EMMC_REG_OFFSET_ADDR_VNDR2_POS                   (0) /* Base offset Address for Command Queuing registers. */

/* EMMC_RESP01_R Register */

#define EMMC_RESP01_MASK                                 (0xFFFFFFFF << 0) /* Command Response. These bits reflect 39-8 bits of SD/eMMC Response Field. Note:  */
#define EMMC_RESP01_POS                                  (0) /* Command Response. These bits reflect 39-8 bits of SD/eMMC Response Field. Note:  */

/* EMMC_RESP23_R Register */

#define EMMC_RESP23_MASK                                 (0xFFFFFFFF << 0) /* Command Response. These bits reflect 71-40 bits of the SD/eMMC Response Field. */
#define EMMC_RESP23_POS                                  (0) /* Command Response. These bits reflect 71-40 bits of the SD/eMMC Response Field. */

/* EMMC_RESP45_R Register */

#define EMMC_RESP45_MASK                                 (0xFFFFFFFF << 0) /* Command Response. These bits reflect 103-72 bits of the Response Field. */
#define EMMC_RESP45_POS                                  (0) /* Command Response. These bits reflect 103-72 bits of the Response Field. */

/* EMMC_RESP67_R Register */

#define EMMC_RESP67_MASK                                 (0xFFFFFFFF << 0) /* Command Response. These bits reflect bits 135-104 of SD/EMMC Response Field. Not */
#define EMMC_RESP67_POS                                  (0) /* Command Response. These bits reflect bits 135-104 of SD/EMMC Response Field. Not */

/* EMMC_SDMASA_R Register */

#define EMMC_BLOCKCNT_SDMASA_MASK                        (0xFFFFFFFF << 0) /* 32-bit Block Count (SDMA System Address). - SDMA System Address (Host Version 4  */
#define EMMC_BLOCKCNT_SDMASA_POS                         (0) /* 32-bit Block Count (SDMA System Address). - SDMA System Address (Host Version 4  */

/* EMMC_SLOT_INTR_STATUS_R Register */

#define EMMC_INTR_SLOT_MASK                              (0xFF << 0) /* Interrupt signal for each Slot       These status bits indicate the logical OR o */
#define EMMC_INTR_SLOT_POS                               (0) /* Interrupt signal for each Slot       These status bits indicate the logical OR o */

/* EMMC_SW_RST_R Register */

#define EMMC_SW_RST_DAT                                  (1U << 2) /* Software Reset For DAT line. This bit is used in SD/eMMC mode and it resets only */
#define EMMC_SW_RST_CMD                                  (1U << 1) /* Software Reset For CMD line. This bit resets only a part of the command circuit  */
#define EMMC_SW_RST_ALL                                  (1U << 0) /* Software Reset For All. This reset affects the entire Host Controller except for */

/* EMMC_TOUT_CTRL_R Register */

#define EMMC_TOUT_CNT_MASK                               (0xF << 0) /* Data Timeout Counter Value. This value determines the interval by which DAT line */
#define EMMC_TOUT_CNT_POS                                (0) /* Data Timeout Counter Value. This value determines the interval by which DAT line */

/* EMMC_VER_ID_R Register */

#define EMMC_VER_ID_MASK                                 (0xFFFFFFFF << 0) /* Current release number An application reading this register in conjunction with  */
#define EMMC_VER_ID_POS                                  (0) /* Current release number An application reading this register in conjunction with  */

/* EMMC_VER_TYPE_R Register */

#define EMMC_VER_TYPE_MASK                               (0xFFFFFFFF << 0) /* Current release type An application reading this register in conjunction with th */
#define EMMC_VER_TYPE_POS                                (0) /* Current release type An application reading this register in conjunction with th */

/* EMMC_WUP_CTRL_R Register */

#define EMMC_CARD_REMOVAL                                (1U << 2) /* Wakeup Event Enable on SD Card Removal. This bit enables wake-up event through C */
#define EMMC_CARD_INSERT                                 (1U << 1) /* Wakeup Event Enable on SD Card Insertion. This bit enables wake-up event through */
#define EMMC_CARD_INT                                    (1U << 0) /* Wakeup Event Enable on Card Interrupt. This bit enables wake-up event through a  */

/* EMMC_XFER_MODE_R Register */

#define EMMC_RESP_INT_DISABLE                            (1U << 8) /* Response Interrupt Disable. The Host Controller supports response check function */
#define EMMC_RESP_ERR_CHK_ENABLE                         (1U << 7) /* Response Error Check Enable. The Host Controller supports response check functio */
#define EMMC_RESP_TYPE                                   (1U << 6) /* Response Type R1/R5. This bit selects either R1 or R5 as a response type when th */
#define EMMC_MULTI_BLK_SEL                               (1U << 5) /* Multi/Single Block Select. This bit is set when issuing multiple-block transfer  */
#define EMMC_DATA_XFER_DIR                               (1U << 4) /* Data Transfer Direction Select. This bit defines the direction of DAT line data  */
#define EMMC_AUTO_CMD_ENABLE_MASK                        (0x3 << 2) /* Auto Command Enable. This field determines use of Auto Command functions.  Value */
#define EMMC_AUTO_CMD_ENABLE_POS                         (2) /* Auto Command Enable. This field determines use of Auto Command functions.  Value */
#define EMMC_BLOCK_COUNT_ENABLE                          (1U << 1) /* Block Count Enable. This bit is used to enable the Block Count register, which i */
#define EMMC_DMA_EN_EMMC                                 (1U << 0) /* DMA Enable. This bit enables the DMA functionality. If this bit is set to 1, a D */

#endif /* __DA1470X_EMMC_H */
